let trips = [
    {
        // первая - основная
        images: ["https://glazov-flash.ru/image/catalog/sol.jpg"],
        name: "СОЛЬ-ИЛЕЦК",
        start: '05.08.2022',
        end: '11.08.2022',
        // продолжительность высчитываем
        // duration: '',
        tripRoute: "деревня Усть - Койва - город Чусовой.",
        distance: "от Перми - 360 км, сплав - 42 км",
        // взрослый - 4000 руб
        cost: [
            { name: "обычный", cost: 4200 },
        ],
        // завлекаем
        offer: "Поездка в Соль-Илецк уже давно стала всеми любимой. Ощутить запах моря и его благотворное воздействие на организм можно, побывав на этих волшебных озерах.",
        description: `<p>Отправление из Глазова каждую пятницу с 17 июня (первый заезд) по 19 августа (последний заезд).</p><p>Продолжительность поездки - 7 днейОтправление в пятницу в 17:00. Посадка у аквапарка "Кристалл"</p><p>Возвращение  вечером в пятницу следующей недели.</p><p>В стоимость включено: переезд на комфортабельном автобусе, страхование на время переезда.</p><p>Проживание оплачивается дополнительно.</p>`,
        // страна республика
        location: "локация",
        // вид тура
        tripType: "тип тура",
        // возраст
        fromAge: "10",
        // июнь 2022 выбираем из справочника
        period: "август 2022",
    },
    {
        // первая - основная
        images: ["https://glazov-flash.ru/image/cache/catalog/tur/active/usva/splav_main-800x800.jpg", "https://glazov-flash.ru/image/cache/catalog/tur/active/usva/splav4-800x800.jpg", "https://glazov-flash.ru/image/cache/catalog/tur/active/usva/splav2-800x800.jpg"],
        name: "Сплав по реке",
        start: '05.07.2022',
        end: '07.07.2022',
        // продолжительность высчитываем
        // duration: '',
        tripRoute: "деревня Усть - Койва - город Чусовой.",
        distance: "от Перми - 360 км, сплав - 42 км",
        // взрослый - 4000 руб
        cost: [
            { name: "взрослый", cost: 5450 },
            { name: "ребёнок 12 - 16 лет", cost: 5200 },
            { name: "ребёнок 8 - 11 лет", cost: 5000 },
        ],
        // завлекаем
        offer: "Поездка в Соль-Илецк уже давно стала всеми любимой. Ощутить запах моря и его благотворное воздействие на организм можно, побывав на этих волшебных озерах.",
        description: `<p>Отправление из Глазова каждую пятницу с 17 июня (первый заезд) по 19 августа (последний заезд).</p><p>Продолжительность поездки - 7 днейОтправление в пятницу в 17:00. Посадка у аквапарка "Кристалл"</p><p>Возвращение  вечером в пятницу следующей недели.</p><p>В стоимость включено: переезд на комфортабельном автобусе, страхование на время переезда.</p><p>Проживание оплачивается дополнительно.</p>`,
        // страна республика
        location: "локация",
        // вид тура
        tripType: "тип тура",
        // возраст
        fromAge: "8",
        // июнь 2022 выбираем из справочника
        period: "август 2022",
    },
    {
        // первая - основная
        images: ["https://glazov-flash.ru/image/catalog/sol.jpg"],
        name: "СОЛЬ-ИЛЕЦК",
        start: '05.08.2022',
        end: '11.08.2022',
        // продолжительность высчитываем
        // duration: '',
        tripRoute: "деревня Усть - Койва - город Чусовой.",
        distance: "от Перми - 360 км, сплав - 42 км",
        // взрослый - 4000 руб
        cost: [
            { name: "обычный", cost: 4200 },
        ],
        // завлекаем
        offer: "Поездка в Соль-Илецк уже давно стала всеми любимой. Ощутить запах моря и его благотворное воздействие на организм можно, побывав на этих волшебных озерах.",
        description: `<p>Отправление из Глазова каждую пятницу с 17 июня (первый заезд) по 19 августа (последний заезд).</p><p>Продолжительность поездки - 7 днейОтправление в пятницу в 17:00. Посадка у аквапарка "Кристалл"</p><p>Возвращение  вечером в пятницу следующей недели.</p><p>В стоимость включено: переезд на комфортабельном автобусе, страхование на время переезда.</p><p>Проживание оплачивается дополнительно.</p>`,
        // страна республика
        location: "локация",
        // вид тура
        tripType: "тип тура",
        // возраст
        fromAge: "10",
        // июнь 2022 выбираем из справочника
        period: "август 2022",
    },
    {
        // первая - основная
        images: ["https://glazov-flash.ru/image/cache/catalog/tur/active/usva/splav_main-800x800.jpg", "https://glazov-flash.ru/image/cache/catalog/tur/active/usva/splav4-800x800.jpg", "https://glazov-flash.ru/image/cache/catalog/tur/active/usva/splav2-800x800.jpg"],
        name: "Сплав по реке",
        start: '05.07.2022',
        end: '07.07.2022',
        // продолжительность высчитываем
        // duration: '',
        tripRoute: "деревня Усть - Койва - город Чусовой.",
        distance: "от Перми - 360 км, сплав - 42 км",
        // взрослый - 4000 руб
        cost: [
            { name: "взрослый", cost: 5450 },
            { name: "ребёнок 12 - 16 лет", cost: 5200 },
            { name: "ребёнок 8 - 11 лет", cost: 5000 },
        ],
        // завлекаем
        offer: "Поездка в Соль-Илецк уже давно стала всеми любимой. Ощутить запах моря и его благотворное воздействие на организм можно, побывав на этих волшебных озерах.",
        description: `<p>Отправление из Глазова каждую пятницу с 17 июня (первый заезд) по 19 августа (последний заезд).</p><p>Продолжительность поездки - 7 днейОтправление в пятницу в 17:00. Посадка у аквапарка "Кристалл"</p><p>Возвращение  вечером в пятницу следующей недели.</p><p>В стоимость включено: переезд на комфортабельном автобусе, страхование на время переезда.</p><p>Проживание оплачивается дополнительно.</p>`,
        // страна республика
        location: "локация",
        // вид тура
        tripType: "тип тура",
        // возраст
        fromAge: "8",
        // июнь 2022 выбираем из справочника
        period: "август 2022",
    },
    {
        // первая - основная
        images: ["https://glazov-flash.ru/image/catalog/sol.jpg"],
        name: "СОЛЬ-ИЛЕЦК",
        start: '05.08.2022',
        end: '11.08.2022',
        // продолжительность высчитываем
        // duration: '',
        tripRoute: "деревня Усть - Койва - город Чусовой.",
        distance: "от Перми - 360 км, сплав - 42 км",
        // взрослый - 4000 руб
        cost: [
            { name: "обычный", cost: 4200 },
        ],
        // завлекаем
        offer: "Поездка в Соль-Илецк уже давно стала всеми любимой. Ощутить запах моря и его благотворное воздействие на организм можно, побывав на этих волшебных озерах.",
        description: `<p>Отправление из Глазова каждую пятницу с 17 июня (первый заезд) по 19 августа (последний заезд).</p><p>Продолжительность поездки - 7 днейОтправление в пятницу в 17:00. Посадка у аквапарка "Кристалл"</p><p>Возвращение  вечером в пятницу следующей недели.</p><p>В стоимость включено: переезд на комфортабельном автобусе, страхование на время переезда.</p><p>Проживание оплачивается дополнительно.</p>`,
        // страна республика
        location: "локация",
        // вид тура
        tripType: "тип тура",
        // возраст
        fromAge: "10",
        // июнь 2022 выбираем из справочника
        period: "август 2022",
    },
    {
        // первая - основная
        images: ["https://glazov-flash.ru/image/cache/catalog/tur/active/usva/splav_main-800x800.jpg", "https://glazov-flash.ru/image/cache/catalog/tur/active/usva/splav4-800x800.jpg", "https://glazov-flash.ru/image/cache/catalog/tur/active/usva/splav2-800x800.jpg"],
        name: "Сплав по реке ",
        start: '05.07.2022',
        end: '07.07.2022',
        // продолжительность высчитываем
        // duration: '',
        tripRoute: "деревня Усть - Койва - город Чусовой.",
        distance: "от Перми - 360 км, сплав - 42 км",
        // взрослый - 4000 руб
        cost: [
            { name: "взрослый", cost: 5450 },
            { name: "ребёнок 12 - 16 лет", cost: 5200 },
            { name: "ребёнок 8 - 11 лет", cost: 5000 },
        ],
        // завлекаем
        offer: "Поездка в Соль-Илецк уже давно стала всеми любимой. Ощутить запах моря и его благотворное воздействие на организм можно, побывав на этих волшебных озерах.",
        description: `<p>Отправление из Глазова каждую пятницу с 17 июня (первый заезд) по 19 августа (последний заезд).</p><p>Продолжительность поездки - 7 днейОтправление в пятницу в 17:00. Посадка у аквапарка "Кристалл"</p><p>Возвращение  вечером в пятницу следующей недели.</p><p>В стоимость включено: переезд на комфортабельном автобусе, страхование на время переезда.</p><p>Проживание оплачивается дополнительно.</p>`,
        // страна республика
        location: "локация",
        // вид тура
        tripType: "тип тура",
        // возраст
        fromAge: "8",
        // июнь 2022 выбираем из справочника
        period: "август 2022",
    },
]


module.exports = {
    async getAll(req, res, next) {
        try {
            return res.json(trips)
        } catch (err) {
            console.log(err);
            // when api error enabled
            // next(err)
        }
    }
}